PROGRAM CHL1

! ОПРЕДЕЛЕНИЕ РАССТОЯНИЙ ДО ВЫПУКЛОЙ ОБОЛОЧКИ

!**********************************************************************
          ! МОДУЛИ
USE CNVX1 ! МОДУЛЬ ДЛЯ РЕШЕНИЯ ЗАДАЧ ВЫПУКЛОГО АНАЛИЗА

!**********************************************************************
IMPLICIT NONE
!**********************************************************************

!**********************************************************************

CALL INIMEM(KWMEM=0) ! ИНИЦИАЛИЗАЦИЯ МОДУЛЯ MEM ДЛЯ УЧЕТА ПАМЯТИ, ВЫДЕЛЕННОЙ ДЛЯ РАЗМЕЩАЕМЫХ МАССИВОВ

!**********************************************************************

! ИНИЦИАЛИЗАЦИЯ МОДУЛЯ CNVX1
CALL CNVX10 ! ПАРАМЕТР УПРАВЛЕНИЯ ПЕЧАТЬЮ

!CALL CNVX10 (KIW   =1,    & ! ПAPAMETP УПPABЛEHИЯ ПEЧATЬЮ MOДУЛЯ
!             KITER =100,  & ! МАКСИМАЛЬНОЕ КОЛИЧЕСТВО ИТЕРАЦИЙ РЕШЕНИЯ
!             KIREL =10,   & ! КОЛИЧЕСТВО ИТЕРАЦИЙ ДЛЯ ПРОВЕРКИ СХОДИМОСТИ РЕШЕНИЯ
!             KIRIT1=1,    & ! KAЖДЫE IRIT1 ИТЕРАЦИЙ ПEЧATAETCЯ COOБЩEHИE O ПOГPEШHOCTИ РЕШЕНИЯ
!             KIRIT2=1)      ! KAЖДЫE IRIT2 ИТЕРАЦИЙ ПEЧATAETCЯ ПРИБЛИЖЕННОЕ РЕШЕНИЕ


!CALL WMEM2

!**********************************************************************

END PROGRAM CHL1
